In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('emp.csv')

In [3]:
df

  id      name   salary  start_date        dept
0  1      Rick   623.30  01-01-2012          IT
1  2       Dan   515.20  23-09-2013  Operations
2  3  Michelle      NaN  15-11-2014          IT
3  4      Ryan   729.00  11-05-2014          HR
4         Gary   843.25  27-03-2015     Finance
5  6      Nina  8478.00  21-05-2013          IT
6  7     Simon  1032.80  30-07-2013  Operations
7  8      Guru   922.50  17-06-2014     Finance

In [4]:
df = df.replace(r'\s+', np.nan, regex=True)

In [5]:
df.describe()

            salary
count     7.000000
mean   1877.721429
std    2915.754540
min     515.200000
25%     676.150000
50%     843.250000
75%     977.650000
max    8478.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
id            7 non-null object
name          8 non-null object
salary        7 non-null float64
start_date    8 non-null object
dept          8 non-null object
dtypes: float64(1), object(4)
memory usage: 400.0+ bytes

In [7]:
df['salary'].sum()

13144.05

In [8]:
df['salary'].mean()

1877.7214285714285

In [10]:
df['salary'].fillna(method='bfill')

0     623.30
1     515.20
2     729.00
3     729.00
4     843.25
5    8478.00
6    1032.80
7     922.50
Name: salary, dtype: float64

In [36]:
df

    id      name   salary  start_date        dept
0    1      Rick   623.30  01-01-2012          IT
1    2       Dan   515.20  23-09-2013  Operations
2    3  Michelle     0.00  15-11-2014          IT
3    4      Ryan   729.00  11-05-2014          HR
4  NaN      Gary   843.25  27-03-2015     Finance
5    6      Nina  8478.00  21-05-2013          IT
6    7     Simon  1032.80  30-07-2013  Operations
7    8      Guru   922.50  17-06-2014     Finance